Напишите программу, на вход которой подается одна строка с целыми числами. Программа должна вывести сумму этих чисел.

numbers = [int(s) for s in input().split()]
print(sum(numbers))
